## Plan Result (Staging - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 10 to add, 0 to change, 10 to destroy.</code></pre>

* Replace
  * module.casetracker.azurerm_role_assignment.dnszonecontributer
  * module.certificatedbailiffs.azurerm_role_assignment.dnszonecontributer
  * module.courtfines.azurerm_role_assignment.dnszonecontributer
  * module.hearings.azurerm_role_assignment.dnszonecontributer
  * module.hearings-reform.azurerm_role_assignment.dnszonecontributer
  * module.immigrationappealsonline.azurerm_role_assignment.dnszonecontributer
  * module.public-dns.azurerm_role_assignment.dnszonecontributer
  * module.staging.azurerm_role_assignment.dnszonecontributer
  * module.staging-internal.azurerm_role_assignment.dnszonecontributer
  * module.tribunalsdecisions.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.casetracker.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.casetracker.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/71c1c121-80a5-b61e-3769-d95f182bdc73" -> (known after apply)
      ~ name                                   = "71c1c121-80a5-b61e-3769-d95f182bdc73" -> (known after apply)
      ~ principal_id                           = "2cab9ccf-e755-4b58-a6b6-692705f3e79d" -> "/groups/2cab9ccf-e755-4b58-a6b6-692705f3e79d" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.certificatedbailiffs.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.certificatedbailiffs.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/ab4537ce-aea8-f711-1fcc-c850022af050" -> (known after apply)
      ~ name                                   = "ab4537ce-aea8-f711-1fcc-c850022af050" -> (known after apply)
      ~ principal_id                           = "2cab9ccf-e755-4b58-a6b6-692705f3e79d" -> "/groups/2cab9ccf-e755-4b58-a6b6-692705f3e79d" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.courtfines.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.courtfines.direct.gov.uk/providers/Microsoft.Authorization/roleAssignments/9ac8fea7-c2cd-ff41-2dd0-a8005fa701ff" -> (known after apply)
      ~ name                                   = "9ac8fea7-c2cd-ff41-2dd0-a8005fa701ff" -> (known after apply)
      ~ principal_id                           = "2cab9ccf-e755-4b58-a6b6-692705f3e79d" -> "/groups/2cab9ccf-e755-4b58-a6b6-692705f3e79d" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.hearings.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.hearings.hmcts.net/providers/Microsoft.Authorization/roleAssignments/bcf9fffc-6722-eef5-2faa-f3cf308155dd" -> (known after apply)
      ~ name                                   = "bcf9fffc-6722-eef5-2faa-f3cf308155dd" -> (known after apply)
      ~ principal_id                           = "2cab9ccf-e755-4b58-a6b6-692705f3e79d" -> "/groups/2cab9ccf-e755-4b58-a6b6-692705f3e79d" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.hearings-reform.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.hearings.reform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/d639e78a-b7b4-1da9-bfb0-1c934fbe4914" -> (known after apply)
      ~ name                                   = "d639e78a-b7b4-1da9-bfb0-1c934fbe4914" -> (known after apply)
      ~ principal_id                           = "2cab9ccf-e755-4b58-a6b6-692705f3e79d" -> "/groups/2cab9ccf-e755-4b58-a6b6-692705f3e79d" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.immigrationappealsonline.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.immigrationappealsonline.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/a06818d4-b274-8f7e-c3b7-bd698c495520" -> (known after apply)
      ~ name                                   = "a06818d4-b274-8f7e-c3b7-bd698c495520" -> (known after apply)
      ~ principal_id                           = "2cab9ccf-e755-4b58-a6b6-692705f3e79d" -> "/groups/2cab9ccf-e755-4b58-a6b6-692705f3e79d" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.public-dns.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/aat.platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/5c53696d-3e46-8526-8f9e-1558780b0631" -> (known after apply)
      ~ name                                   = "5c53696d-3e46-8526-8f9e-1558780b0631" -> (known after apply)
      ~ principal_id                           = "2cab9ccf-e755-4b58-a6b6-692705f3e79d" -> "/groups/2cab9ccf-e755-4b58-a6b6-692705f3e79d" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.staging.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/37ab8ca3-bad5-99ca-ab84-1823793fc02b" -> (known after apply)
      ~ name                                   = "37ab8ca3-bad5-99ca-ab84-1823793fc02b" -> (known after apply)
      ~ principal_id                           = "2cab9ccf-e755-4b58-a6b6-692705f3e79d" -> "/groups/2cab9ccf-e755-4b58-a6b6-692705f3e79d" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.staging-internal.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.internal.hmcts.net/providers/Microsoft.Authorization/roleAssignments/f4f6a694-f068-76f4-0d3d-7783e734205b" -> (known after apply)
      ~ name                                   = "f4f6a694-f068-76f4-0d3d-7783e734205b" -> (known after apply)
      ~ principal_id                           = "2cab9ccf-e755-4b58-a6b6-692705f3e79d" -> "/groups/2cab9ccf-e755-4b58-a6b6-692705f3e79d" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.tribunalsdecisions.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.tribunalsdecisions.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/ee85cee1-d82d-4532-2a59-ca5fe55f7f39" -> (known after apply)
      ~ name                                   = "ee85cee1-d82d-4532-2a59-ca5fe55f7f39" -> (known after apply)
      ~ principal_id                           = "2cab9ccf-e755-4b58-a6b6-692705f3e79d" -> "/groups/2cab9ccf-e755-4b58-a6b6-692705f3e79d" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 10 to add, 0 to change, 10 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1856,"Program":"tfcmt","SHA1":"","Target":"Staging - TerraformPlanApply","Vars":{}} -->